package com.example.alStudy.doIt.sorlting;

public class Generics {
    /*
        제네릭스는 처리 대상의 자료형에 의존하지 않도록 클래스(인터페이스)를 구현하는 기능입니다.
        제네릭 클래스는 자료형에 의존하지 않기 때문에 범용으로 사용할 수 있습니다.
        제네릭 인터페이스는 클래스와 인터페이스 이름 바로 뒤에 <Type> 형식의 매개변수를 붙여 선언합니다.

        이 때,
        1. 대문자는 1개를 사용합니다.(소문자는 가급적 사용하지 않습니다.)
        2. 컬렉션 내부 요소의 자료형은 element의 머리글자인 E를 사용합니다.
        3. 맵(Map) 내 키(Key)와 값(Value)의 자료형은 key와 value의 머리글자인 K, V를 사용합니다.
        4. 일반적인 자료형은 T를 사용합니다.

        파라미터에는 와일드카드를 지정할 수도 있습니다.
        <? extends T> : 클래스  T의 하위 클래스를 전달받습니다.
        <? super T> : 클래스 T의 상위 클래스를 전달받습니다.
     */


}
